Repository: sheilagomes/wp-trad
Catalog: tm/GNOME_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: The Application Assistant will generate a basic skeleton for a project, including all of the build files. It will ask for details of the initial structure for the application. Please answer the questions carefully, as it may not be possible to change some of the settings later.
pt_br: O Assistente de Aplicativo irá gerar a estrutura básica de um projeto, incluindo todos os arquivos de compilação (build files). Ele solicitará alguns detalhes sobre a estrutura inicial do aplicativo. Por favor, responda atentamente às questões, já que poderá não ser possível modificar algumas destas definições posteriormente.

source: label
pt_br: rótulo

source: Scintilla based component for editing files
pt_br: Componente baseado em Scintilla para edição de arquivos

source: Sample Plugin
pt_br: Plug-in de exemplo

source: Scintilla Editor
pt_br: Editor Scintilla

source: An alternate editor based on Scintilla
pt_br: Um editor alternativo baseado em GtkSourceview

source: Plus/Minus
pt_br: Mais/Menos

source: Arrows
pt_br: Setas

source: Squares
pt_br: Quadrados

source: Enable Python comments folding
pt_br: Habilitar folding de comentários python

source: Enable Python quoted strings folding
pt_br: Habilitar folding de expressões python entre aspas

source: Lines
pt_br: Linhas

source: File: %s
pt_br: Arquivo: %s

source: No file to print!
pt_br: Nenhum arquivo para imprimir!

source: The file '%s' has been changed. Do you want to reload it?
pt_br: O arquivo "%s" foi alterado. Deseja recarregá-lo?

source: The file '%s' has been changed. Do you want to loose your changes and reload it?
pt_br: O arquivo "%s" foi alterado. Deseja perder suas alterações e recarregá-lo?

source: The file '%s' has been deleted. Do you confirm and close it?
pt_br: O arquivo "%s" já foi excluído. Você confirma e fechá-lo?

source: The file '%s' has been deleted. Do you want to lose your changes and close it?
pt_br: O arquivo "%s" foi excluído. Deseja perder suas alterações e fechá-lo?

source: Error while reading from file
pt_br: Erro ao ler o arquivo

source: Could not save intermediate file %s: %s
pt_br: Não foi possível salvar o arquivo intermediário %s: %s

source: Change build commands to use scratchbox 1 or 2
pt_br: Altere comandos de conmpilação para utilizar o scratchbox 1 ou 2

source: Fixed data-view
pt_br: Visualização de dados fixa

source: Update
pt_br: Atualizar

source: Cumulative Seconds
pt_br: Segundos cumulativos

source: Self ms/call
pt_br: ms/call próprio

source: Total ms/call
pt_br: ms/call total

source: Could not get profiling data. Please check the path to this target's profiling data file.
pt_br: Não foi possível obter os dados do perfilação. Por favor, verifique o caminho para o arquivo de dados de perfilação deste alvo.

source: This target does not have any profiling data. Please ensure that the target is complied with profiling support and that it is run at least once.
pt_br: Esse alvo não tem dados de perfilação. Por favor, certifique-se de que o alvo tenha sido compilado com suporte a perfilação e que ele tenha sido executado pelo menos uma vez.

source: Debug
pt_br: Depurar

source: Application Performance Profiler
pt_br: Perfilador de desempenho do aplicativo

source: Call Graph
pt_br: Gráfico das chamadas

source: Function Call Chart
pt_br: Gráfico de chamada de função

source: The file '%s' has been changed. Do you want to reload it ?
pt_br: O arquivo "%s" foi alterado. Deseja recarregá-lo?

source: The file '%s' has been changed. Do you want to loose your changes and reload it ?
pt_br: O arquivo "%s" foi alterado. Deseja perder suas alterações e recarregá-lo?

source: The file '%s' has been deleted. Do you confirm and close it ?
pt_br: O arquivo "%s" já foi excluído. Você confirma e fecha-o?

source: The file '%s' has been deleted. Do you want to loose your changes and close it ?
pt_br: O arquivo "%s" foi excluído. Deseja perder suas alterações e fechá-lo?

source: Options
pt_br: Opções

source: Select debugging target
pt_br: Selecione o alvo de depuração

source: No executable target selected for debugging with Valgrind. Please select one.
pt_br: Nenhum executável selecionado para depuração com Valgrind. Por favor, selecione um.

source: There aren't any available executable targets for this project. Please create one first.
pt_br: Não existe nenhum alvo executável disponível para este projeto. Por favor, crie um primeiro.

source: _Replace
pt_br: _Substituir

source: _Debug
pt_br: _Depurar

source: _Select Tool and Run...
pt_br: _Selecionar ferramenta e executar...

source: Use Valgrind debug tool
pt_br: Usar ferramenta de depuração Valgrind

source: Valgrind general preferences
pt_br: Preferências gerais do Valgrind

source: Valgrind binary file path:
pt_br: Caminho do arquivo binário Valgrind:

source: Choose Valgrind Binary File Path...
pt_br: Escolher caminho do arquivo executável Valgrind...

source: Reached the end of the input file or error in parsing valgrind output.
pt_br: Chegou ao fim do arquivo de entrada ou erro ao analisar a saída do Valgrind.

source: Process exited.
pt_br: Processo encerrado.

source: Could not get the right valgrind-binary gconf key:
pt_br: Não pôde obter a chave correta de valgrind-binary gconf

source: Valgrind binary [%s] does not exist. Please check the preferences or install Valgrind package.
pt_br: O binário Valgrind [%s] não existe. Por favor, verifique as preferências ou instale o pacote Valgrind.

source: Could not get the right pipe for the process.
pt_br: Não foi possível obter o pipe correto para o processo.

source: Invalid regular expression: '%s': %s
pt_br: Expressão regular inválida: "%s": %s

source: Valgrind Suppression Rules
pt_br: Regras de supressão do Valgrind

source: Valgrind Suppression
pt_br: Supressão do Valgrind

source: _Copy
pt_br: _Copiar

source: General
pt_br: Geral

source: Demangle C++ symbol names
pt_br: Usar demangle nos nomes de símbolos C++

source: Assume thread stacks are used privately
pt_br: Supor que thread stacks são usadas privativamente

source: Show location of last word access on error:
pt_br: Mostrar localização do último acesso da palavra no erro:

source: bytes in the queue after being free()'d
pt_br: bytes na fila após serem liberados com free()

source: Function
pt_br: Função

source: Call chain:
pt_br: Cadeia de chamadas:

source: Error saving to suppression file '%s': %s
pt_br: Erro ao escrever no arquivo "%s": %s

source: You have forgotten to name your suppression rule.
pt_br: Você esqueceu de nomear sua regra de supressão.

source: Application performance profiler
pt_br: Perfilador de desempenho do aplicativo

source: Powerful debugging tool.
pt_br: Poderosa ferramenta de depuração.

source: Valgrind Plugin
pt_br: Plug-in de Valgrind

source: Anjuta IDE
pt_br: IDE Anjuta

source: Unable to find plugin module %s
pt_br: Não foi possível localizar o módulo do plug-in %s

source: Unable to find plugin registration function %s in module %s
pt_br: Não foi possível localizar a função de registro %s do plug-in no módulo %s

source: Unknown error in module %s
pt_br: Erro desconhecido no módulo %s

source: Missing location of plugin %s
pt_br: Faltando a localização do plug-in %s

source: Missing type defined by plugin %s
pt_br: Faltando tipo definido pelo plug-in %s

source: plugin %s fails to register type %s
pt_br: plug-in %s falhou ao registrar o tipo %s

source: The file you are trying to open contains an invalid byte sequence.
pt_br: O arquivo que você está tentando abrir contém uma seqüência de bytes inválida.

source: anjuta was not able to automatically determine the encoding of the file you want to open.
pt_br: o Anjuta não pôde determinar automaticamente a codificação do arquivo que você deseja abrir.

source: Western
pt_br: Ocidental

source: Baltic
pt_br: Báltico

source: Arabic
pt_br: Arábico

source: Greek
pt_br: Grego

source: Hebrew
pt_br: Hebreu

source: Turkish
pt_br: Turco

source: Nordic
pt_br: Nórdico

source: Celtic
pt_br: Céltico

source: Romanian
pt_br: Romeno

source: Armenian
pt_br: Armênio

source: Japanese
pt_br: Japonês

source: Korean
pt_br: Coreano

source: Georgian
pt_br: Georgiano

source: Vietnamese
pt_br: Vietnamita

source: Unknown
pt_br: Desconhecido

source: Anjuta Shell
pt_br: Shell do Anjuta

source: Plugin '%s' do not want to be deactivated
pt_br: O plug-in "%s" não quer ser desativado

source: Could not load %s This usually means that your installation is corrupted. The error message leading to this was: %s
pt_br: Não foi possível carregar %s Isto normalmente significa que sua instalação está corrompida. A mensagem de erro foi: %s

source: Load
pt_br: Carregar

source: These are the plugins selected by you when Anjuta prompted to choose one of many suitable plugins. Removing the preferred plugin will let Anjuta prompt you again to choose different plugin.
pt_br: Estes são os plug-ins selecionados por você quando Anjuta lhe dá a opção de escolher um dos muitos plug-ins disponíveis. Remover o plug-in preferencial deixará o Anjuta pedí-lo novamente que escolha um plug-in diferente.

source: Forget selected plugin
pt_br: Esqueça o plug-in selecionado

source: Please select a plugin to activate
pt_br: Por favor selecione um plug-in para ativar

source: No plugin able to load other plugins in %s
pt_br: Nenhum plug-in habilitado para carregar outros plug-ins em %s

source: Current stack of profiles
pt_br: Pilha atual de perfis

source: Currently available plugins found in plugin paths
pt_br: Plug-ins disponíveis, localizados na pasta de plug-ins

source: Loaded:
pt_br: Carregado:

source: The plugin manager to use for resolving plugins
pt_br: O gerenciador de plug-ins usado para resolução de plug-ins

source: Name of the plugin profile
pt_br: Nome do perfil de plug-in

source: List of plugins for this profile
pt_br: Lista de plug-ins para este perfil

source: Synchronization file
pt_br: Arquivo para sincronização

source: File to sync the profile xml
pt_br: Arquivo para sincronizar o XML do perfil

source: Please select a plugin from the list
pt_br: Por favor selecione um plug-in da lista

source: Failed to read '%s': XML parse error. Invalid or corrupted anjuta plugins profile.
pt_br: Falha ao ler "%s": erro de análise do XML. Perfil inválido ou corrompido de plug-ins do Anjuta.

source: %s: Install it from '%s'
pt_br: %s: Instalar a partir de "%s"

source: Failed to read '%s': Following mandatory plugins are missing: %s
pt_br: Falha ao ler "%s": Os seguintes plug-ins obrigatórios estão faltando: %s

source: Are you sure you want to reset the preferences to their default settings?
pt_br: Você tem certeza que deseja restaurar as preferências para as definições padrão originais?

source: Category
pt_br: Categoria

source: Anjuta Preferences
pt_br: Preferências do Anjuta

source: _Discard changes
pt_br: _Descartar mudanças

source: Action
pt_br: Ação

source: Visible
pt_br: Visível

source: Shortcut
pt_br: Atalho

source: System:
pt_br: Sistema:

source: The "%s" utility is not installed. Please install it.
pt_br: O utilitário "%s" não está instalado. Por favor, instale-o.

source: Modified
pt_br: Modificado

source: Added
pt_br: Adicionado

source: Deleted
pt_br: Excluído

source: Conflicted
pt_br: Em conflito

source: Missing
pt_br: Faltando

source: Unversioned
pt_br: Sem controle de versão

source: Text
pt_br: Texto

source: Text to render
pt_br: Texto a renderizar

source: The pixbuf to render.
pt_br: O pixbuf a renderizar.

source: Configuration:
pt_br: Configuração:

source: Install
pt_br: Instalar

source: Regenerate project
pt_br: Regenera o projeto:

source: Select Program to run:
pt_br: Escolha o programa a executar:

source: Arguments:
pt_br: Argumentos:

source: Build Directory:
pt_br: Diretório de compilação:

source: Configure Options:
pt_br: Opções do configure:

source: Configure Project
pt_br: Configurar projeto

source: Continue on errors
pt_br: Continua com erros

source: Highlight message locations in editor
pt_br: Destaca as posições das mensagens no editor

source: Run in terminal
pt_br: Executar em um terminal

source: Run several commands at a time:
pt_br: Executa vários comandos ao mesmo tempo:

source: Select Program
pt_br: Escolha o programa

source: Select a build directory
pt_br: Selecione um diretório para compilação

source: Translate messages
pt_br: Traduzir mensagens

source: Profiling
pt_br: Perfilando

source: Optimized
pt_br: Otimizado

source: No executables in this project!
pt_br: Nenhum executável neste projeto!

source: Program
pt_br: Programa

source: No file or project currently opened.
pt_br: Nenhum arquivo ou projeto aberto.

source: No executable for this file.
pt_br: Nenhum executável para este arquivo.

source: make(\\[\\d+\\])?:\\s+Entering\\s+directory\\s+`(.+)'
pt_br: make(\\[\\d+\\])?:\\s+Entrando\\s+no diretório\\s+`(.+)'

source: make(\\[\\d+\\])?:\\s+Entering\\s+directory\\s+'(.+)'
pt_br: make(\\[\\d+\\])?:\\s+Entrando\\s+no\\s+diretório\\s+`(.+)'

source: make(\\[\\d+\\])?:\\s+Leaving\\s+directory\\s+`(.+)'
pt_br: make(\\[\\d+\\])?:\\s+Saindo\\s+do\\s+diretório\\s+`(.+)"

source: make(\\[\\d+\\])?:\\s+Leaving\\s+directory\\s+'(.+)'
pt_br: make(\\[\\d+\\])?:\\s+Saindo\\s+do\\s+diretório\\s+`(.+)"

source: warning:
pt_br: aviso:

source: error:
pt_br: erro:

source: Command exited with status %d
pt_br: O comando saiu com status %d

source: Command canceled by user
pt_br: Comando cancelado pelo usuário

source: Command aborted by user
pt_br: Comando interrompido pelo usuário

source: Command terminated with signal %d
pt_br: O comando terminou com sinal %d

source: Command terminated for an unknown reason
pt_br: O comando terminou por uma razão desconhecida

source: Total time taken: %lu secs
pt_br: Tempo total utilizado: %lu segundos

source: Completed unsuccessfully
pt_br: Concluído sem sucesso

source: Completed successfully
pt_br: Concluído com sucesso

source: Can not compile "%s": No compile rule defined for this file type.
pt_br: Não foi possível compilar "%s": Nenhuma regra de compilação definida para esse tipo de arquivo.

source: Can not configure project: Missing configure script in %s.
pt_br: Não foi possível configurar o projeto: Falta o script de configuração em %s.

source: C_onfigure Project...
pt_br: _Configurar projeto...

source: Install module associated with current file
pt_br: Instala o módulo associado com o arquivo atual

source: Clean module associated with current file
pt_br: Limpa o módulo associado ao arquivo atual

source: Co_mpile File
pt_br: Co_mpilar Arquivo

source: Compile current editor file
pt_br: Compila o arquivo de código atualmente no editor

source: Select Configuration
pt_br: Selecione uma configuração

source: Select current configuration
pt_br: Seleciona a configuração corrente

source: Remove Configuration
pt_br: Remover configuração

source: Clean project (distclean) and remove configuration directory if possible
pt_br: Limpa o projeto (distclean) e remove o diretório da configuração se possível

source: _Compile
pt_br: _Compilar

source: Compile file
pt_br: Compila o arquivo

source: _Install
pt_br: I_nstalar

source: Install module
pt_br: Instala o módulo

source: _Clean
pt_br: _Limpar

source: Clean module
pt_br: Limpa o módulo

source: _Cancel command
pt_br: C_ancelar comando

source: Cancel build command
pt_br: Cancela o comando de compilação

source: _Install (%s)
pt_br: I_nstalar (%s)

source: _Clean (%s)
pt_br: _Limpar (%s)

source: Co_mpile (%s)
pt_br: Co_mpilar (%s)

source: Co_mpile
pt_br: Co_mpilar

source: Build Autotools
pt_br: Opções de construção

source: Command aborted
pt_br: Comando interrompido

source: Update the graph
pt_br: Atualizar o gráfico

source: Author/Date/Time
pt_br: Autor/Data/Hora

source: Base Class Inheritance:
pt_br: Hereditariedade da classe base:

source: Create
pt_br: Criar

source: General Public License (GPL) Lesser General Public License (LGPL) No License
pt_br: General Public License (GPL) Lesser General Public License (LGPL) Sem Licença

source: License:
pt_br: Licença:

source: Member Functions/Variables
pt_br: Funções-Membro/Variáveis

source: Properties
pt_br: Propriedades

source: Header or source file has not been created
pt_br: Cabeçalho ou arquivo fonte não foi criado

source: File to which the processed template will be written
pt_br: Arquivo no qual o modelo processado será escrito

source: XML description of the user interface
pt_br: Descrição XML da interface de usuário

source: CVS Options
pt_br: Opções CVS

source: Module Details:
pt_br: Detalhes do Módulo:

source: Options:
pt_br: Opções:

source: Please note: Pressing OK will delete the file from disk and from CVS. Of course the file won't be removed from CVS before you use CVS Commit. You have been warned!
pt_br: Por favor, note que: Ao pressionar OK você deletará o arquivo do disco e do CVS. Obviamente, o arquivo não será removido do CVS antes que você utilize o Commit CVS. Você foi alertado!

source: Repository:
pt_br: Repositório:

source: CVS Preferences
pt_br: Preferências do CVS

source: Choose file or directory to add:
pt_br: Escolha o arquivo ou diretório a ser adicionado:

source: Choose file or directory to commit:
pt_br: Escolha o arquivo ou diretório para commit:

source: Choose file or directory to diff:
pt_br: Escolha o arquivo ou diretório para diff:

source: Choose file or directory to get log:
pt_br: Escolha o arquivo ou diretório para obter log:

source: Choose file or directory to get the status from:
pt_br: Escolha o arquivo ou diretório de onde obter o estado:

source: Choose file or directory to remove:
pt_br: Escolha o arquivo ou diretório a ser removido:

source: Choose file or directory to update:
pt_br: Escolha o arquivo ou diretório a ser atualizado:

source: Create new directories
pt_br: Criar novos diretórios

source: Do not act recursively
pt_br: Não agir recursivamente

source: File is binary
pt_br: O arquivo é binário

source: Ignore .cvsrc file (recommended)
pt_br: Ignorar o arquivo .cvsrc (recomendado)

source: Local Extern (rsh) Password server (pserver)
pt_br: Local Externo (rsh) Senha do servidor (pserver)

source: Module name:
pt_br: Nome do módulo:

source: Password:
pt_br: Senha:

source: Path to "cvs" command
pt_br: Caminho para o comando "cvs"

source: Release tag:
pt_br: Tag da versão:

source: Reset sticky tags
pt_br: Redefine todas as tags associadas

source: Standard diff Patch-Style diff
pt_br: Diff padrão Diff de Estilo de Patch

source: Unified format instead of context format
pt_br: Formato especial ao invés de formato de contexto

source: Use revision/tag:
pt_br: Utilizar revisão/tag:

source: Use revision:
pt_br: Utilizar revisão:

source: Username:
pt_br: Nome do usuário:

source: Whole project
pt_br: Todo o projeto

source: Please fill field: %s
pt_br: Por favor, preencha o campo: %s

source: CVS command is running! Please wait until it is finished!
pt_br: O comando CVS está em execução! Por favor, aguarde sua finalização!

source: Are you sure that you want to pass an empty log message?
pt_br: Você tem certeza que quer fornecer uma mensagem de log vazia?

source: Module
pt_br: Módulo

source: Release
pt_br: Versão

source: Directory
pt_br: Diretório

source: Are you sure that you do not want a log message?
pt_br: Você tem certeza de que não deseja uma mensagem de log?

source: CVS command failed - See above for details
pt_br: O comando CVS falhou - Veja os detalhes acima

source: CVS command is running - please wait until it finishes!
pt_br: O comando CVS está em execução - por favor, aguarde sua finalização!

source: _Add
pt_br: _Adicionar

source: Add a new file/directory to the CVS tree
pt_br: Adiciona um novo arquivo/diretório à árvore CVS

source: _Remove
pt_br: _Remover

source: Remove a file/directory from CVS tree
pt_br: Remove um arquivo/diretório da árvore CVS

source: Commit your changes to the CVS tree
pt_br: Submete as suas alterações para a árvore CVS

source: _Update
pt_br: _Atualizar

source: Sync your local copy with the CVS tree
pt_br: Sincroniza sua cópia local com a árvore CVS

source: Show differences between your local copy and the tree
pt_br: Mostra as diferenças entre sua cópia local e a árvore

source: Show the log of a file/directory
pt_br: Mostra o log do arquivo/diretório

source: _Import Tree
pt_br: I_mportar Árvore

source: Import a new source tree to CVS
pt_br: Importa uma nova árvore fonte para o CVS

source: CVS operations
pt_br: Operações CVS

source: Debugger:
pt_br: Depurador:

source: Remote debugging
pt_br: Depuração remota

source: Address:
pt_br: Endereço:

source: Attach to process
pt_br: Anexar ao processo

source: Breakpoint properties
pt_br: Propriedades dos pontos de interrupção

source: CPU Registers
pt_br: Registradores de CPU

source: Connect to remote target
pt_br: Conectar ao alvo remoto

source: Description:
pt_br: Descrição:

source: Disable
pt_br: Desabilitar

source: Display process _tree
pt_br: Exibir a árvore de _processos

source: Enable _all
pt_br: _Habilitar tudo

source: Enter an address in hexadecimal or select one in the data
pt_br: Digite um endereço hexadecimal ou selecione um a partir dos dados

source: Hide process para_meters
pt_br: Ocultar parâ_metros de processo

source: Inspect
pt_br: Inspecionar

source: Inspect/Evaluate
pt_br: Inspecionar/Avaliar

source: Location
pt_br: Local

source: Memory
pt_br: Memória

source: Pass:
pt_br: Passar:

source: Port:
pt_br: Porta:

source: Select one directory
pt_br: Selecione um diretório

source: Serial Line Connection
pt_br: Conexão de linha serial

source: Shared libraries
pt_br: Bibliotecas compartilhadas

source: Signal:
pt_br: Sinal:

source: Start Debugger
pt_br: Iniciar o depurador

source: TCP/IP Connection
pt_br: Conexão TCP/IP

source: Yes
pt_br: Sim

source: _Attach
pt_br: _Anexar

source: _Condition:
pt_br: _Condição:

source: _Disable all
pt_br: _Desabilitar todos

source: _Hide paths
pt_br: _Ocultar caminhos

source: _Pass count:
pt_br: Contador de _passos:

source: _Process to attach to:
pt_br: _Processo ao qual anexar:

source: _Remove all
pt_br: _Remover todos

source: Are you sure you want to delete all the breakpoints?
pt_br: Você tem certeza de que deseja excluir todos os pontos de interrupção?

source: Toggle Breakpoint
pt_br: Alternar ponto de interrupção

source: Toggle breakpoint at the current location
pt_br: Alterna o ponto de interrupção na localização atual

source: Edit Breakpoint
pt_br: Edita pontos de Interrupção

source: Disable All Breakpoints
pt_br: Desabilita todos os Pontos de Interrupção

source: R_emove All Breakpoints
pt_br: R_emover todos os pontos de interrupção

source: Remove all breakpoints
pt_br: Remove todos os pontos de interrupção

source: Disable Breakpoint
pt_br: Desabilitar ponto de interrupção

source: Disable a breakpoint
pt_br: Desabilita um ponto de interrupção

source: Enabled
pt_br: Habilitado

source: Address
pt_br: Endereço

source: Type
pt_br: Tipo

source: Condition
pt_br: Condição

source: Pass count
pt_br: Contador de passos

source: State
pt_br: Estado

source: _Goto address
pt_br: Endereço de _goto

source: Variable
pt_br: Variável

source: Information
pt_br: Informações

source: Locals
pt_br: Locais

source: Debugger terminated with error %d: %s
pt_br: O depurador terminou com o erro %d: %s

source: _Start Debugger
pt_br: I_niciar o Depurador

source: _Debug Program
pt_br: _Depurar o programa

source: Start debugger and load the program
pt_br: Inicia o depurador e carrega o programa

source: _Debug Process...
pt_br: _Depurar o processo...

source: Start debugger and attach to a running program
pt_br: Inicia o depurador e vincula a um programa em execução

source: Debug _Remote Target...
pt_br: Depurar alvo _remoto...

source: Connect to a remote debugging target
pt_br: Conecta a um alvo remoto de depuração

source: Say goodbye to the debugger
pt_br: Diga adeus para o depurador
